---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.CannotConvertFlexPipeToPart
source: html/c84eb0ba-ca83-2cb1-a5af-91ad7954789c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.CannotConvertFlexPipeToPart Property

Cannot convert flex pipe to fabrication part.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConvertFlexPipeToPart { get; }
```